# Getting Started with pandas

1. Review를 위한 단계
- 방식 : chapter05 장을 보면서 이해하고 주석 달기
- 제출 방식 : 강사가 제시한 폴더에 파일명 수정해서 제출하기
- 파일명 : **step03_bookReview임동원.ipynb**

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Introduction to pandas Data Structures

### Series

In [3]:
# pd.Series 리스트를 시리즈로 만드는 함수
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
# .values 데이터의 값을 표현
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
# .index 인덱스 값을 표현
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
# 데이터값과 인덱스를 지정해 변수에 저장
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
# 변수의 인덱스를 표현
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
# a 인덱스에 해당하는 값
obj2['a']

-5

In [9]:
# b 인덱스에 해당하는 값에 6을 대입
obj2['d'] = 6
obj2['d']

6

In [10]:
# c a d의 값을 표현
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [11]:
# 변수인덱스 값 전체를 표현
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [12]:
# 변수의 값 중 0보다 큰 거
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
# 변수의 값에 2를 곱한 값 출력
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
# 밑이 e인 자연상수로 변환
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
# 변수 키값에 b가 있나요?
'b' in obj2

True

In [16]:
# 변수 키값에 e가 있나요?
'e' in obj2

False

In [17]:
# 데이터를 시리즈로 변환
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
# state변수의 내용을 키값으로, sdata의 내용을 밸류로 대응해 시리즈로 만드는 함수
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
# 변수의 null값인 부분을 찾아 boolean타입으로 반환해주는 함수
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
#  null값이 아닌걸 반환
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
# null반환
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
#  밸류끼리 덧셈
obj3
obj4
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
# 변수 출력
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
# 시리즈 객체의 name 속성명을 지정
obj4.name = 'population'
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [25]:
# 시리즈 인덱스 객체의 name을 지정
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
# 변수에 인덱스 이름을 부여
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [28]:
# 사전타입을 데이터프레임 형태로 변환
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
# 사전타입 출력
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [30]:
# df타입 출력
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [31]:
# df에서 상위 5개만 출력
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [32]:
# df로 만드는 과정에서 칼럼명으로 정렬
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [33]:
# 칼럼명과 인덱스명을 같이 주는 함수 (불러올 값이 없는 debt는 NaN값만이 덩그러니)
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [34]:
# df의 칼럼 이름만 출력
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [35]:
# df에서 특정 칼럼만 뽑아 출력
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [36]:
# 특정 칼럼 출력
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [37]:
# df 출력
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [38]:
# loc - df의 특절 칼럼의 '이름'으로 해당 칼럼출력
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [39]:
# 특정 칼럼에 내용을 일괄적으로 대입
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [40]:
# 특정 칼럼 값에 range를 써 연속하는 수를 대입
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [41]:
# 변수에 인덱스와 값을 지정
# df의 debt 칼럼에 val변수에 입력된 내용을 대입
# 인덱스와 매칭되는 부분은 대입 / 그렇지 않으면 기존값 반환
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [43]:
# df에 새로운 칼럼 추가
# 칼럼  값으로 state칼럼 값이 ohio일 경우 True 대입
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [44]:
# 아까 만든 칼럼 삭제
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [ ]:
# 출력
frame2

In [45]:
# 새로운 사전타입 변수 선언
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [46]:
# 사전변수를 데이터 프레임으로 변환
# 사전의 깊이마다 칼럼 - 인덱스 - 값 순으로 생성
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [52]:
# 행과 열을 바꾸는 함수
# 엄밀히 말하면 (1,2,4,2) => (2,4,2,1) 처럼 순서를 뒤집는 개념인데 2차원에서만 '행과 열을 뒤집는다'는 개념이 성립
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [53]:
# 출력
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [54]:
# 출력
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [50]:
# 출력
pd.DataFrame(pop)#, index=[2000, 2001, 2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [55]:
# 라이브러리 내용 출력
pd

In [56]:
# 라이브러리 버전 출력
!pip show pandas

Name: pandas
Version: 0.23.4
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: python-dateutil, pytz, numpy
Required-by: seaborn, odo

In [57]:
# p167 교재와 다름, 
# 인덱스를 직접 지정해 df 생성
pd.DataFrame(pop, index=pd.Int64Index([2001, 2000, 2002]))

      Nevada  Ohio
2001     2.4   1.7
2000     NaN   1.5
2002     2.9   3.6

In [ ]:
# 출력
frame3

In [58]:
# 오하이오 칼럼 뒤에서 한 개 빼고 전부 출력 (슬라이싱)
frame3['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [59]:
# 오하이오 칼럼 전체 출력
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [60]:
# 오하이로 칼럼과 네바다 칼럼의 값들을 슬라이싱한 만큼만 변수에 저장
# 발췌된 일부분으로 새로운 데이터 프레임 생성
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [61]:
# 출력
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [62]:
# 칼럼이름은 state 인덱스 이름은 year로 지정
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [63]:
# df값 array 형태로 출력
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [64]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

In [65]:
# 인덱스값을 지정하고, 값은 0~2까지의 정수
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [66]:
# 인덱스값 출력
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [72]:
# 첫 행 제외하고 출력
index[1:]

Index(['b', 'c'], dtype='object')

index[1] = 'd'  # TypeError

In [68]:
# 0~2까지 인덱스 저장
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [69]:
# 리스트 타입을 Series로 변환하는데 인덱스 값으로 변수 값 지정
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [73]:
# 변수의 인덱스 출력
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [71]:
# 변수의 인덱스이름이 라벨즈인가?
obj2.index is labels

True

In [ ]:
# 출력
frame3

In [ ]:
# df의 컬럼명 출력
frame3.columns

In [ ]:
# 칼럼중에 오하이오가 있는지
'Ohio' in frame3.columns

In [ ]:
# 컬럼 index중에 2003이 있는지
2003 in frame3.index

In [74]:
# 리스트를 인덱스에 넣어 변수로 선언
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

In [77]:
# 인덱스 지정
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [78]:
# 인덱스 값을 새로 지정한 뒤 변수에 저장
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [79]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [80]:
# range함수로 인덱스를 6개로 늘리고 빈 값은 method = 'ffill'로 앞의 값을 채워넣는다.
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [81]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [82]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [83]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [84]:
# frame df를 칼럼순서대로 재배열
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis

In [85]:
# 시리즈 생성
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [86]:
# 시리즈에서 인덱스로 접근해 삭제하고 저장
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [87]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [88]:
# 
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [89]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [90]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
# 가로축에 있는 칼럼을 기준으로 삭제
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [92]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [94]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [95]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [96]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [97]:
# 시리즈 생성
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [98]:
# 인덱스 값으로 접근
obj['b']

1.0

In [100]:
# 인덱스 위치로 접근
obj[1]

1.0

In [101]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [102]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [103]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [104]:
# 인덱스 위치 2 이하 => 0,1 출력
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [105]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [106]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [107]:
# 인덱스 값으로 접근해 5라는 값을 대입
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [108]:
# 4x4df 만들고 칼럼  인덱스 값 지정
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [110]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [111]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [112]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
# 1단계 - 조건을 준다.
data['Utah'] > 5
# 2단계 - 조건을 데이터 안에 다시 넣는다.
data[data['two'] > 5]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [120]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [121]:
# 5보다 작은 값은 전부 0으로 바꿈
data[data < 5] = 0

In [122]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

In [123]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [124]:
# 콜로라도 인덱스에서 two, three 칼럼에 해당하는 내용 반환
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [125]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
# iloc 열 / 행 순서로 인덱싱 진행
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [127]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [128]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [129]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [ ]:
data.iloc[:, :3][data.three > 5]

### Integer Indexes

ser = pd.Series(np.arange(3.))
ser
ser[-1]

In [131]:
ser = pd.Series(np.arange(3.))

In [132]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [133]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [134]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [135]:
ser2[-1]

2.0

In [136]:
ser[:1]

0    0.0
dtype: float64

In [137]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [138]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [139]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [140]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [141]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [142]:
# 두개 다 있는 인덱스만 정상 연산 / 나머지는 NaN값 반환
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [143]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [144]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [145]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [146]:
# 칼럼과 인덱스가 겹치는 부분만 정산 연산 / 나머지는 NaN
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [147]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [148]:
df1

   A
0  1
1  2

In [149]:
df2

   B
0  3
1  4

In [150]:
# 겹치는 칼럼이 없어 전부 NaN 
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [151]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [152]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [153]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [154]:
df2.loc[1, 'b'] = np.nan

In [155]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [156]:
# 칼럼과 인덱스가 일치하더라도 NaN값이 섞여있다면 NaN출력
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [157]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [158]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [163]:
# df1에 df2를 덮어씌우며 덧셈하는 함수 .add / NaN인 경우는 fill_value = 0이라는 파라미터를 사용해 0을 더해줌
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [164]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [165]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [166]:
# 실수 1을 df1로 나눈 것
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [168]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [169]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [167]:
# df1의 칼럼을 df2 칼럼들로 대체 -> NaN값이 나올 곳은 0값으로 대체
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [170]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [172]:
arr[0]

array([0., 1., 2., 3.])

In [173]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [174]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [175]:
series = frame.iloc[0]

In [176]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [177]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [178]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [179]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [180]:
series2

b    0
e    1
f    2
dtype: int64

In [181]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [182]:
series3 = frame['d']

In [183]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [184]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [185]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [186]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [187]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.692371  0.905862 -0.537789
Ohio   -0.453658 -1.618782 -1.517354
Texas  -1.772657  0.024078 -1.106167
Oregon -0.693967 -0.974228 -0.240158

In [188]:
# abs절대값
np.abs(frame)

               b         d         e
Utah    0.692371  0.905862  0.537789
Ohio    0.453658  1.618782  1.517354
Texas   1.772657  0.024078  1.106167
Oregon  0.693967  0.974228  0.240158

In [189]:
# 사용자 정의 함수를 판다스에 적용시키는 함수 .apply()  -  기본이 칼럼값 기준으로(axis = 0)
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.318999
d    2.524644
e    1.277197
dtype: float64

In [190]:
frame.apply(f, axis='columns')

Utah      1.598233
Ohio      1.165124
Texas     1.796735
Oregon    0.734070
dtype: float64

In [191]:
frame.apply(f, axis=1)

Utah      1.598233
Ohio      1.165124
Texas     1.796735
Oregon    0.734070
dtype: float64

In [192]:
frame

               b         d         e
Utah   -0.692371  0.905862 -0.537789
Ohio   -0.453658 -1.618782 -1.517354
Texas  -1.772657  0.024078 -1.106167
Oregon -0.693967 -0.974228 -0.240158

In [193]:
# 각 칼럼(변수)별로 최대값 최소값 출력하는 함수 => .apply()적용
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -1.772657 -1.618782 -1.517354
max -0.453658  0.905862 -0.240158

In [194]:
# 모든 값을 소수점 2자리수까지만 표현하는 함수
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.69   0.91  -0.54
Ohio    -0.45  -1.62  -1.52
Texas   -1.77   0.02  -1.11
Oregon  -0.69  -0.97  -0.24

In [195]:
frame['e'].map(format)

Utah      -0.54
Ohio      -1.52
Texas     -1.11
Oregon    -0.24
Name: e, dtype: object

### Sorting and Ranking

In [196]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [197]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [198]:
# 인덱스 기준으로 오름차순
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [199]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [200]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [201]:
# 인덱스 오름차순
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [202]:
# 칼럼 오름차순
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [203]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [204]:
# 칼럼 내림차순
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [205]:
obj = pd.Series([4, 7, -3, 2])

In [206]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [207]:
# 값을 기준으로 오름차순
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [208]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [209]:
# 오름차순이지만 NaN값은 맨 나중에
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [210]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [211]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [212]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [213]:
# 순서쌍은 무시하고 기준이 되는 칼럼은 죄다 오름차순으로 줄세우기
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [224]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [225]:
# 낮은놈이 위 순서
# 똑같은놈이 두명이면 평균값으로 표현한다 
# (공동4등이 2명이면 => 4+5/2   =>  4.5 / 4.5)
# (공동4등이 3명이면 => 4+5+6/3 =>   5 / 5 / 5)
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [226]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [227]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [228]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [229]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [230]:
frame.rank('columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [216]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
#obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [217]:
# 인덱스가 겹치는지 아닌지 판별
obj.index.is_unique

False

In [218]:
obj['a']

a    0
a    1
dtype: int64

In [219]:
obj['c']

4

In [220]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.693755 -0.379194 -0.401214
a  0.753092  0.337967 -0.313607
b -0.234718  0.687985 -1.494185
b  0.405895  0.461720 -0.259812

In [221]:
df.loc['b']

          0         1         2
b -0.234718  0.687985 -1.494185
b  0.405895  0.461720 -0.259812

## Summarizing and Computing Descriptive Statistics

In [231]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [232]:
# 위아래로 덧셈
df.sum()

one    9.25
two   -5.80
dtype: float64

In [233]:
# 가로로 덧셈
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [234]:
# 가로로 덧셈(NaN섞여있으면 계산불가)
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [236]:
# 가로로 덧셈(NaN무시하고 덧셈 / 전부다 NaN이면 좀...)
df.mean(axis='columns', skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [238]:
#  최댓값을 가지는 인덱스 출력
df.idxmax()

one    b
two    d
dtype: object

In [239]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [241]:
# 누적합 => cumulated sum
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [242]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [243]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [244]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Unique Values, Value Counts, and Membership

In [245]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [246]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [248]:
# 값이 몇개인지 카운팅
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [249]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [250]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [252]:
# b c값이 있으면 True
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [254]:
# b c 있는것만 시리즈 형태로 출력
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [256]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [257]:
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [258]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [259]:
unique_vals

0    c
1    b
2    a
dtype: object

In [260]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [261]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [262]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 누락된 데이터 처리하기

1. 누락된 데이터를 처리하는 일은 데이터 분석 애플리케이션에서 빈번한 작업
- 모든 기술 통계는 누락된 데이터를 배제하고 처리
- 처리 방법 1 : 수집된 데이터를 직접 제거
- 처리 방법 2 : dropna 함수 사용하여 처리

In [263]:
from numpy import nan as NA

Series의 NA값 제거해 보기

In [264]:
data = Series([1, NA, 3.5, NA, 7])

In [265]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [266]:
# 모든 결측치 날려버리기
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [267]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [268]:
# null값이 아닌 데이터 조건식 사용해 반환
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

DataFrame의 NA값 제거하기

In [269]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [270]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [271]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [272]:
# 전부 NaN인것만 날리기
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [273]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [274]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [275]:
df = DataFrame(np.random.randn(7, 3))

In [276]:
df

          0         1         2
0 -0.753442  0.287843 -0.420088
1  1.363053 -1.023594 -0.771479
2  1.098958 -0.869024  0.235677
3 -1.247413  0.369920 -2.560537
4 -0.324657 -0.857608 -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [278]:
df.loc[:4, 1] = NA

In [279]:
df

          0         1         2
0 -0.753442       NaN -0.420088
1  1.363053       NaN -0.771479
2  1.098958       NaN  0.235677
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [280]:
df.loc[:2, 2] = NA
df

          0         1         2
0 -0.753442       NaN       NaN
1  1.363053       NaN       NaN
2  1.098958       NaN       NaN
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [282]:
# 임계치3 => 데이터 3개 이상 멀쩡한것만 남기기 (NoN NaN 3개)
df.dropna(thresh=3)

          0         1         2
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [283]:
df

          0         1         2
0 -0.753442       NaN       NaN
1  1.363053       NaN       NaN
2  1.098958       NaN       NaN
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [284]:
df.dropna(thresh=2, axis=0)

          0         1         2
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [289]:
# axis 1이니까 칼럼에 붙어있는 값을 유심히 본다.
# thresh2니까 멀쩡한거 2개 붙어있으면 남긴다.
df.dropna(thresh=2, axis=1)

          0         1         2
0 -0.753442       NaN       NaN
1  1.363053       NaN       NaN
2  1.098958       NaN       NaN
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [302]:
df.dropna(thresh=3, axis=1)

          0         2
0 -0.753442       NaN
1  1.363053       NaN
2  1.098958       NaN
3 -1.247413 -2.560537
4 -0.324657 -1.034076
5 -0.194223 -1.580937
6  1.024452  0.640763

In [290]:
df

          0         1         2
0 -0.753442       NaN       NaN
1  1.363053       NaN       NaN
2  1.098958       NaN       NaN
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [291]:
df.dropna(thresh=5, axis=1)

          0
0 -0.753442
1  1.363053
2  1.098958
3 -1.247413
4 -0.324657
5 -0.194223
6  1.024452

In [292]:
df.dropna(thresh=3, axis=1)

          0         2
0 -0.753442       NaN
1  1.363053       NaN
2  1.098958       NaN
3 -1.247413 -2.560537
4 -0.324657 -1.034076
5 -0.194223 -1.580937
6  1.024452  0.640763

누락된 값 채우기

In [293]:
df

          0         1         2
0 -0.753442       NaN       NaN
1  1.363053       NaN       NaN
2  1.098958       NaN       NaN
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [294]:
df.fillna(0)

          0         1         2
0 -0.753442  0.000000  0.000000
1  1.363053  0.000000  0.000000
2  1.098958  0.000000  0.000000
3 -1.247413  0.000000 -2.560537
4 -0.324657  0.000000 -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [295]:
df

          0         1         2
0 -0.753442       NaN       NaN
1  1.363053       NaN       NaN
2  1.098958       NaN       NaN
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [298]:
# 1 칼럼 결측치는 0.5 / 3칼럼 결측치는 -1로 채우기
df.fillna({1:0.5, 3:-1})

          0         1         2
0 -0.753442  0.500000       NaN
1  1.363053  0.500000       NaN
2  1.098958  0.500000       NaN
3 -1.247413  0.500000 -2.560537
4 -0.324657  0.500000 -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [299]:
df

          0         1         2
0 -0.753442       NaN       NaN
1  1.363053       NaN       NaN
2  1.098958       NaN       NaN
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

In [300]:
df.fillna({2:10})

          0         1          2
0 -0.753442       NaN  10.000000
1  1.363053       NaN  10.000000
2  1.098958       NaN  10.000000
3 -1.247413       NaN  -2.560537
4 -0.324657       NaN  -1.034076
5 -0.194223  0.466782  -1.580937
6  1.024452  0.315062   0.640763

In [301]:
df

          0         1         2
0 -0.753442       NaN       NaN
1  1.363053       NaN       NaN
2  1.098958       NaN       NaN
3 -1.247413       NaN -2.560537
4 -0.324657       NaN -1.034076
5 -0.194223  0.466782 -1.580937
6  1.024452  0.315062  0.640763

## 계층적 색인

1. pandas의 중요한 기능
- 축에 대해 다중(2개 이상) 색인 단계 지정 가능(MultiIndex)
- 고차원 데이터를 낮은 차원의 형식으로 다룰수 있게 해주는 기능

In [303]:
data = Series(np.random.randn(10),  
              index=[
                      ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], 
                      [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]
              ])

In [304]:
# 같은 1단계 인덱스에 속하면 자동으로 분류된다. ( a - 1,2,3)
data

a  1    0.932136
   2    1.220239
   3    0.746303
b  1   -2.410080
   2    0.065568
   3    0.458525
c  1    0.915584
   2    1.716507
d  2   -0.105411
   3    3.112925
dtype: float64

In [305]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [306]:
data.values

array([ 0.93213595,  1.22023919,  0.74630301, -2.41007974,  0.06556754,
        0.4585246 ,  0.91558401,  1.71650707, -0.10541079,  3.1129252 ])

계층적으로 색인된 객체는 데이터의 부분 집합을 부분적 색인으로 접근이 가능

In [307]:
data['b']

1   -2.410080
2    0.065568
3    0.458525
dtype: float64

In [308]:
data['b':'c']

b  1   -2.410080
   2    0.065568
   3    0.458525
c  1    0.915584
   2    1.716507
dtype: float64

In [309]:
data.loc[['b', 'c']]

b  1   -2.410080
   2    0.065568
   3    0.458525
c  1    0.915584
   2    1.716507
dtype: float64

In [310]:
data

a  1    0.932136
   2    1.220239
   3    0.746303
b  1   -2.410080
   2    0.065568
   3    0.458525
c  1    0.915584
   2    1.716507
d  2   -0.105411
   3    3.112925
dtype: float64

하위 계층의 객체 선택

In [311]:
data[:, 2]

a    1.220239
b    0.065568
c    1.716507
d   -0.105411
dtype: float64

계층적인 색인은 데이터를 재형성 가능

In [312]:
data.unstack()

          1         2         3
a  0.932136  1.220239  0.746303
b -2.410080  0.065568  0.458525
c  0.915584  1.716507       NaN
d       NaN -0.105411  3.112925

In [313]:
data

a  1    0.932136
   2    1.220239
   3    0.746303
b  1   -2.410080
   2    0.065568
   3    0.458525
c  1    0.915584
   2    1.716507
d  2   -0.105411
   3    3.112925
dtype: float64

In [314]:
# 스택 언스택 반복가능
data.unstack().stack()

a  1    0.932136
   2    1.220239
   3    0.746303
b  1   -2.410080
   2    0.065568
   3    0.458525
c  1    0.915584
   2    1.716507
d  2   -0.105411
   3    3.112925
dtype: float64

In [315]:
frame = DataFrame(np.arange(12).reshape(4,3), 
                  index=[['a','a','b','b'], [1, 2, 1, 2]], 
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [316]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [318]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [319]:
frame.index.names

FrozenList([None, None])

In [320]:
frame.index.names = ['key1', 'key2']

In [321]:
frame.index.name

In [322]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [323]:
frame.columns

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]])

In [324]:
frame.columns.names = ['state', 'color']

In [325]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [326]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

계층 순서 바꾸고 정렬하기

In [327]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [328]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [329]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [330]:
frame.sort_index(1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

단계별 요약통계
> level 옵션 : 한축에 대해 합을 구하고 싶은 단계 지정할 수 있는 옵션

In [331]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [332]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

In [333]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

DataFrame의 컬럼 사용하기

In [334]:
frame = DataFrame({'a':range(7), 'b':range(7, 0, -1), 
                   'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'], 
                   'd' : [0, 1, 2, 0, 1, 2, 3]})

In [335]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [336]:
# 하나 이상의 칼럼을 색인으로 하는 새로운 DataFrame 생성
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [337]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [338]:
# 명시적으로 컬럼 남겨두기
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [339]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [340]:
#계층적 색인 단계를 칼럼으로 이동
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1